In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

# NaN not a Number

In [3]:
np.nan

nan

In [4]:
type(np.nan)

float

In [5]:
a = 1
b = np.nan
c = a + b

In [6]:
c

nan

In [7]:
1.0 + np.nan

nan

In [8]:
1.0 * np.nan

nan

# NaN in Series

In [9]:
s1 = Series([1,2, np.nan, np.nan], index=['A','B','C','D'])

In [10]:
s1

A    1.0
B    2.0
C    NaN
D    NaN
dtype: float64

In [11]:
s1.isnull()

A    False
B    False
C     True
D     True
dtype: bool

In [12]:
s1.notnull()

A     True
B     True
C    False
D    False
dtype: bool

In [13]:
s1.dropna()

A    1.0
B    2.0
dtype: float64

# NaN in DataFrame

In [14]:
df = DataFrame([[1,2,3],[4,np.nan,6],[7,np.nan,9]])

In [15]:
df

   0    1  2
0  1  2.0  3
1  4  NaN  6
2  7  NaN  9

In [16]:
df.isnull()

       0      1      2
0  False  False  False
1  False   True  False
2  False   True  False

In [17]:
df.notnull()

      0      1     2
0  True   True  True
1  True  False  True
2  True  False  True

In [18]:
df.dropna()

   0    1  2
0  1  2.0  3

In [20]:
df.dropna(how='all')

   0    1  2
0  1  2.0  3
1  4  NaN  6
2  7  NaN  9

In [23]:
df = DataFrame([[1,2,3,4],[5,np.nan,np.nan,8],[np.nan,np.nan,np.nan,np.nan]])
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  5.0  NaN  NaN  8.0
2  NaN  NaN  NaN  NaN

In [29]:
df.dropna(axis=1,how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [31]:
df.fillna(axis=0, value={1:1, 2:2})

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  5.0  1.0  2.0  8.0
2  NaN  1.0  2.0  NaN

In [32]:
df.fillna(axis=0, value={1:1, 2:2})

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  5.0  1.0  2.0  8.0
2  NaN  1.0  2.0  NaN